aaron-ev/CLI-STM32-FreeRTOS/workspace/cliFreeRTOS/Core/Src/console.c

/**
 ******************************************************************************
 * @file         console.c
 * @author       Aaron Escoboza, Github account: https://github.com/aaron-ev
 * @brief        Command Line Interpreter based on FreeRTOS and STM32 HAL layer
 ******************************************************************************
 */

#include "FreeRTOS.h"
#include "FreeRTOS_CLI.h"
#include "task.h"
#include "queue.h"
#include "stm32f401xc.h"
#include "stm32f4xx_hal.h"
#include "stdio.h"
#include "stdlib.h"
#include "string.h"
#include "bsp.h"

#define MAX_IN_STR_LEN                          300
#define MAX_OUT_STR_LEN                         600
#define MAX_RX_QUEUE_LEN                        300

                                                      /* ASCII code definition */
#define ASCII_TAB                               '\t'  /* Tabulate              */
#define ASCII_CR                                '\r'  /* Carriage return       */
#define ASCII_LF                                '\n'  /* Line feed             */
#define ASCII_BACKSPACE                         '\b'  /* Back space            */
#define ASCII_FORM_FEED                         '\f'  /* Form feed             */
#define ASCII_DEL                               127   /* Delete                */
#define ASCII_CTRL_PLUS_C                         3   /* CTRL + C              */
#define ASCII_NACK                               21   /* Negative acknowledge  */

char cRxData;
QueueHandle_t xQueueRxHandle;
UART_HandleTypeDef *pxUartDevHandle;
static const char *pcWelcomeMsg = "Welcome to the console. Enter 'help' to view a list of available commands.\n";

static const char *prvpcTaskListHeader = "Task states: Bl = Blocked, Re = Ready, Ru = Running, De = Deleted,  Su = Suspended\n\n"\
                                         "Task name         State  Priority  Stack remaining  CPU usage  Runtime(us)\n"\
                                         "================= =====  ========  ===============  =========  ===========\n";
static const char *prvpcPrompt = "#cmd: ";

/* Command function prototypes */
static BaseType_t prvCommandPwmSetFreq(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandPwmSetDuty(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandGpioWrite(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandGpioRead( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandEcho( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandTaskStats( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandHeap(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandClk(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandTicks(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandRtcGet(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandRtcSet(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString);

/**
*   @brief  This function is executed in case of error occurrence.
*   @retval None
*/
static const char *prvpcMapTaskState(eTaskState eState)
{
    switch (eState)
    {
        case     eReady: return "Re";
        case   eRunning: return "Ru";
        case   eDeleted: return "De";
        case   eBlocked: return "Bl";
        case eSuspended: return "S";
        default: return "??";
    }
}

static const CLI_Command_Definition_t xCommands[] =
{
    {
        "stats",
        "\r\nstats:\r\n Displays a table with the state of each FreeRTOS task.\r\n",
        prvCommandTaskStats,
        0
    },
    {
        "gpio-w",
        "\r\ngpio-w <gpio port> <pin number> <logical value>: Write a digital value to GPIO pin.\r\n",
        prvCommandGpioWrite,
        3
    },
    {
        "gpio-r",
        "\r\ngpio-r <gpio port> <pin number>: Read a GPIO pin.\r\n",
        prvCommandGpioRead,
        2
    },
    {
       "echo",
       "\r\necho <string to echo>\r\n",
       prvCommandEcho,
       1
    },
    {
        "pwm-f",
        "\r\npwm-f <Frequency>: Set a new frequency.\r\n",
        prvCommandPwmSetFreq,
        1
    },
    {
        "pwm-d",
        "\r\npwm-d <Duty cycle> Channel>: Set a new PWM duty cycle of a giving channel.\r\n",
        prvCommandPwmSetDuty,
        2
    },
    {
        "heap",
        "\r\nheap: Display free heap memory.\r\n",
        prvCommandHeap,
        0
    },
    {
        "clk",
        "\r\nclk: Display clock information.\r\n",
        prvCommandClk,
        0
    },
    {
        "ticks",
        "\r\nticks: Display OS tick count and run time in seconds.\r\n",
        prvCommandTicks,
        0
    },
    {
        "rtc-g",
        "\r\nrtc-g: Get the current time\r\n",
        prvCommandRtcGet,
        0
    },
    {
        "rtc-s",
        "\r\nrtc-s <Hours> <Minutes> <Seconds>: Set a new time\r\n",
        prvCommandRtcSet,
        3
    },
    { NULL, NULL, NULL, 0 }
};

/**
* @brief Command that gets task statistics.
* @param *pcWriteBuffer FreeRTOS CLI write buffer.
* @param xWriteBufferLen Length of write buffer.
* @param *pcCommandString pointer to the command name.
* @retval FreeRTOS status
*/
static BaseType_t prvCommandTaskStats( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString)
{
    static uint32_t uTaskIndex = 0;
    static uint32_t uTotalOfTasks = 0;
    static uint32_t uTotalRunTime = 1;
    TaskStatus_t *pxTmpTaskStatus = NULL;
    static TaskStatus_t *pxTaskStatus = NULL;

    if (pxTaskStatus == NULL)
    {
        uTotalOfTasks = uxTaskGetNumberOfTasks();
        pxTaskStatus = pvPortMalloc(uTotalOfTasks * sizeof(TaskStatus_t));
        if (pxTaskStatus == NULL)
        {
           snprintf(pcWriteBuffer, xWriteBufferLen, "Error: Not enough memory for task allocation");
           goto out_cmd_task_stats;
        }
        uTotalOfTasks = uxTaskGetSystemState(pxTaskStatus, uTotalOfTasks, &uTotalRunTime);
        uTaskIndex = 0;
        uTotalRunTime /= 100;
        snprintf(pcWriteBuffer, xWriteBufferLen, prvpcTaskListHeader);
    }
    else
    {
        memset(pcWriteBuffer, 0x00, MAX_OUT_STR_LEN);
        /* Prevent from zero division */
        if (!uTotalRunTime)
        {
            uTotalRunTime = 1;
        }

        pxTmpTaskStatus = &pxTaskStatus[uTaskIndex];
        if (pxTmpTaskStatus->ulRunTimeCounter / uTotalRunTime < 1)
        {
         snprintf(pcWriteBuffer, xWriteBufferLen,
                 "%-16s  %5s  %8lu  %14dB       < 1%%  %11lu\n",
                 pxTmpTaskStatus->pcTaskName,
                 prvpcMapTaskState(pxTmpTaskStatus->eCurrentState),
                 pxTmpTaskStatus->uxCurrentPriority,
                 pxTmpTaskStatus->usStackHighWaterMark,
                 pxTmpTaskStatus->ulRunTimeCounter);
        }
        else
        {
            snprintf(pcWriteBuffer, xWriteBufferLen,
                    "%-16s  %5s  %8lu  %14dB  %8lu%%  %11lu\n",
                    pxTmpTaskStatus->pcTaskName,
                    prvpcMapTaskState(pxTmpTaskStatus->eCurrentState),
                    pxTmpTaskStatus->uxCurrentPriority,
                    pxTmpTaskStatus->usStackHighWaterMark,
                    pxTmpTaskStatus->ulRunTimeCounter / uTotalRunTime,
                    pxTmpTaskStatus->ulRunTimeCounter);
        }
        uTaskIndex++;
    }

    /* Check if there is more tasks to be process */
    if (uTaskIndex < uTotalOfTasks)
       return pdTRUE;
    else
    {
out_cmd_task_stats :
        if (pxTaskStatus != NULL)
        {
            vPortFree(pxTaskStatus);
            pxTaskStatus = NULL;
        }
        return pdFALSE;
    }
}

/**
* @brief Command that writes to a GPIOx pin.
* @param *pcWriteBuffer FreeRTOS CLI write buffer.
* @param xWriteBufferLen Length of write buffer.
* @param *pcCommandString pointer to the command name.
* @retval FreeRTOS status
*/
static BaseType_t prvCommandGpioWrite(char *pcWriteBuffer, size_t xWriteBufferLen,\
                                      const char *pcCommandString)
{
    BaseType_t xParamLen;
    BspPinNum_e bspPinNum;
    const char * pcGpioPinNum;
    const char * pcGpioPinSate;
    const char * pcGpioInstance;
    BspGpioPinState_e bspPinState;
    BspGpioInstance_e bspGpioInstance;

    /* Get GPIO instance and map it from data type char to BSP integer value */
    pcGpioInstance = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
    bspGpioInstance = bspGpioMapInstance(*pcGpioInstance);
    if (bspGpioInstance >= BSP_MAX_GPIO_INSTANCE)
    {
        snprintf(pcWriteBuffer, xWriteBufferLen, "Error: invalid GPIO port\n");
        goto out_cmd_gpio_write;
    }

