aaron-ev/CLI-STM32-FreeRTOS/workspace/cliFreeRTOS/Core/Src/console.c
    /* Get pin number */
    pcGpioPinNum = FreeRTOS_CLIGetParameter(pcCommandString, 2, &xParamLen);
    bspPinNum = atoi(pcGpioPinNum);
    if (bspPinNum < BSP_GPIO_PIN_0 || bspPinNum > BSP_GPIO_PIN_15)
    {
        snprintf(pcWriteBuffer, xWriteBufferLen, "Error: invalid pin number\n");
        goto out_cmd_gpio_write;
    }

    /* Get new pin state */
    pcGpioPinSate = FreeRTOS_CLIGetParameter(pcCommandString, 3, &xParamLen);
    bspPinState = atoi(pcGpioPinSate);
    if (bspPinState > BSP_GPIO_PIN_HIGH)
    {
        snprintf(pcWriteBuffer, xWriteBufferLen, "Error: invalid pin state\n");
        goto out_cmd_gpio_write;
    }

    /* Write the new pin state to the GPIO pin and fill FreeRTOS write buffer */
    bspGpioWrite(bspGpioInstance, bspPinNum, bspPinState);
    snprintf(pcWriteBuffer, xWriteBufferLen, "GPIO: %c, Pin: %c set to %d\n",
             *pcGpioInstance, *pcGpioPinNum, bspPinState);

out_cmd_gpio_write:
    return pdFALSE;
}

/**
* @brief Command that reads from GPIOx Pin
* @param *pcWriteBuffer FreeRTOS CLI write buffer.
* @param xWriteBufferLen Length of write buffer.
* @param *pcCommandString pointer to the command name.
* @retval FreeRTOS status
*/
static BaseType_t prvCommandGpioRead(char *pcWriteBuffer, size_t xWriteBufferLen\
                                     , const char *pcCommandString)
{
    BaseType_t xParamLen;
    const char * pcGpioPinNum;
    const char * pcGpioInstance;
    BspPinNum_e bspPinNum;
    BspGpioPinState_e xPinState;
    BspGpioInstance_e bspGpioInstance;

    /* Get GPIO instance and map it from data type char to BSP integer value */
    pcGpioInstance = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
    bspGpioInstance = bspGpioMapInstance(*pcGpioInstance);
    if (bspGpioInstance >= BSP_MAX_GPIO_INSTANCE)
    {
        snprintf(pcWriteBuffer, xWriteBufferLen, "Error: invalid GPIO port\n");
        goto out_cmd_gpio_read;
    }

    /* Get pin number */
    pcGpioPinNum = FreeRTOS_CLIGetParameter(pcCommandString, 2, &xParamLen);
    bspPinNum = atoi(pcGpioPinNum);
    if (bspPinNum < BSP_GPIO_PIN_0 || bspPinNum > BSP_GPIO_PIN_15)
    {
        snprintf(pcWriteBuffer, xWriteBufferLen, "Error: invalid pin number\n");
        goto out_cmd_gpio_read;
    }

    /* Read pin state and fill FreeRTOS write buffer */
    xPinState = bspGpioRead(bspGpioInstance, bspPinNum);
    snprintf(pcWriteBuffer, xWriteBufferLen, "GPIO: %c Pin: %c state: %d\n",
            *pcGpioInstance, *pcGpioPinNum, xPinState);

out_cmd_gpio_read:
    return pdFALSE;
}

/**
* @brief Echo command line in UNIX systems.
* @param *pcWriteBuffer FreeRTOS CLI write buffer.
* @param xWriteBufferLen Length of write buffer.
* @param *pcCommandString pointer to the command name.
* @retval FreeRTOS status
*/
static BaseType_t prvCommandEcho( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString)
{
    const char *pcStrToOutput;
    BaseType_t xParamLen;

    /* Get the user input and write it back the FreeRTOS write buffer */
    pcStrToOutput = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
    snprintf(pcWriteBuffer, xWriteBufferLen, "%s\n", pcStrToOutput);

    return pdFALSE;
}

/**
* @brief Command that sets a new pwm frequency.
* @param *pcWriteBuffer FreeRTOS CLI write buffer.
* @param xWriteBufferLen Length of write buffer.
* @param *pcCommandString pointer to the command name.
* @retval FreeRTOS status
*/
static BaseType_t prvCommandPwmSetFreq(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString)
{
    const char * pcFreq;
    BaseType_t xParamLen;
    BspError_e bspStatus;

    pcFreq = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
    bspStatus = bspPwmSetFreq(atoi(pcFreq));
    if (bspStatus == BSP_ERROR_EINVAL)
        snprintf(pcWriteBuffer, xWriteBufferLen, "Error: Invalid parameter\n");
    else if (bspStatus == BSP_ERROR_EIO)
        snprintf(pcWriteBuffer, xWriteBufferLen, "Error: I/O error\n");
    else
        snprintf(pcWriteBuffer, xWriteBufferLen, "Frequency set to %dHz\n", atoi(pcFreq));

    return pdFALSE;
}

/**
* @brief Command that sets a new pwm duty cycle.
* @param *pcWriteBuffer FreeRTOS CLI write buffer.
* @param xWriteBufferLen Length of write buffer.
* @param *pcCommandString pointer to the command name.
* @retval FreeRTOS status
*/
static BaseType_t prvCommandPwmSetDuty(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString)
{
    BspError_e bspStatus;
    BaseType_t xParamLen;
    const char * pcChannel;
    const char * pcDutyCycle;

    pcDutyCycle = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
    pcChannel = FreeRTOS_CLIGetParameter(pcCommandString, 2, &xParamLen);

    /* Index starts at index 0, so 1 is subtracted from channel */
    bspStatus = bspPwmSetDuty(atoi(pcDutyCycle), atoi(pcChannel) - 1);
    if (bspStatus == BSP_ERROR_EINVAL)
        snprintf(pcWriteBuffer, xWriteBufferLen, "Error: Invalid parameter\n");
    else if (bspStatus == BSP_ERROR_EIO)
        snprintf(pcWriteBuffer, xWriteBufferLen, "Error: I/O error\n");
    else
        snprintf(pcWriteBuffer, xWriteBufferLen, "Channel %d set to %d%% duty cycle \n", atoi(pcChannel), atoi(pcDutyCycle));

    return pdFALSE;
}

/**
* @brief Command that gets heap information
* @param *pcWriteBuffer FreeRTOS CLI write buffer.
* @param xWriteBufferLen Length of write buffer.
* @param *pcCommandString pointer to the command name.
* @retval FreeRTOS status
*/
static BaseType_t prvCommandHeap(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString)
{

    size_t xHeapFree;
    size_t xHeapMinMemExisted;

    xHeapFree = xPortGetFreeHeapSize();
    xHeapMinMemExisted = xPortGetMinimumEverFreeHeapSize();
    snprintf(pcWriteBuffer, xWriteBufferLen,
             "Heap size            : %3u bytes (%3d KiB)\nRemaining            : %3u bytes (%3d KiB)\nMinimum ever existed : %3u bytes (%3d KiB)\n",
             configTOTAL_HEAP_SIZE, configTOTAL_HEAP_SIZE / 1024, xHeapFree, xHeapFree / 1024, xHeapMinMemExisted, xHeapMinMemExisted / 1024);

