aaron-ev/CLI-STM32-FreeRTOS/workspace/cliFreeRTOS/Core/Src/console.c
    return pdFALSE;
}

/**
* @brief Command that gets clock information from current clock settings.
* @param *pcWriteBuffer FreeRTOS CLI write buffer.
* @param xWriteBufferLen Length of write buffer.
* @param *pcCommandString pointer to the command name.
* @retval FreeRTOS status
*/
static BaseType_t prvCommandClk(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString)
{
    bspGetClockIinfo(pcWriteBuffer, xWriteBufferLen);
    return pdFALSE;
}

/**
* @brief Command that calculate OS ticks information.
* @param *pcWriteBuffer FreeRTOS CLI write buffer.
* @param xWriteBufferLen Length of write buffer.
* @param *pcCommandString pointer to the command name.
* @retval FreeRTOS status
*/
static BaseType_t prvCommandTicks(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString)
{
    uint32_t uMs;
    uint32_t uSec;
    TickType_t xTickCount = xTaskGetTickCount();

    uSec = xTickCount / configTICK_RATE_HZ;
    uMs = xTickCount % configTICK_RATE_HZ;
    snprintf(pcWriteBuffer, xWriteBufferLen,
             "Tick rate: %u Hz\nTicks: %lu\nRun time: %lu.%.3lu seconds\n",
              (unsigned)configTICK_RATE_HZ, xTickCount, uSec, uMs);

    return pdFALSE;
}


/**
* @brief Get the current time stored in RTC registers
* @param *pcWriteBuffer FreeRTOS CLI write buffer.
* @param xWriteBufferLen Length of write buffer.
* @param *pcCommandString pointer to the command name.
* @retval FreeRTOS status
*/
static BaseType_t prvCommandRtcGet(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString)
{
    BspRtcTime bspRtcTime;
    BspError_e bspStatus;

    bspStatus = bspRtcGetTime(&bspRtcTime);
    if (bspStatus != BSP_NO_ERROR)
        snprintf(pcWriteBuffer, xWriteBufferLen, "Error: Could not get current time\n");

    snprintf(pcWriteBuffer, xWriteBufferLen, "Time (24hr format): %u:%u:%u\n",
            bspRtcTime.uHours, bspRtcTime.uMinutes, bspRtcTime.uSeconds);

    return pdFALSE;
}

/**
* @brief Set a new time in RCT registers
* @param *pcWriteBuffer FreeRTOS CLI write buffer.
* @param xWriteBufferLen Length of write buffer.
* @param *pcCommandString pointer to the command name.
* @retval FreeRTOS status
*/
static BaseType_t prvCommandRtcSet(char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString)
{
    const char *cHours;
    const char *cMinutes;
    const char *cSeconds;
    BaseType_t xParamLen;
    BspError_e bspStatus;
    BspRtcTime bspRtcTime;

    cHours = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
    cMinutes = FreeRTOS_CLIGetParameter(pcCommandString, 2, &xParamLen);
    cSeconds = FreeRTOS_CLIGetParameter(pcCommandString, 3, &xParamLen);

    bspRtcTime.uHours = atoi(cHours);
    bspRtcTime.uMinutes = atoi(cMinutes);
    bspRtcTime.uSeconds = atoi(cSeconds);

    bspStatus = bspRtcSetTime(&bspRtcTime);
    if (bspStatus == BSP_ERROR_EINVAL)
    {
        snprintf(pcWriteBuffer, xWriteBufferLen, "Error: Invalid parameters\n");
        goto out_cmd_rtc_set;
    }
    else if (bspStatus == BSP_ERROR_EIO)
    {
        snprintf(pcWriteBuffer, xWriteBufferLen, "Error: I/O\n");
        goto out_cmd_rtc_set;
    }
    else
    {
        snprintf(pcWriteBuffer, xWriteBufferLen, "Time (24hr format) set to: %u:%u:%u\n",
                bspRtcTime.uHours, bspRtcTime.uMinutes, bspRtcTime.uSeconds);
    }

out_cmd_rtc_set:
    return pdFALSE;
}

/**
* @brief Reads from UART RX buffer. Reads one bye at the time.
* @param *cReadChar pointer to where data will be stored.
* @retval FreeRTOS status
*/
static BaseType_t xConsoleRead(uint8_t *cReadChar, size_t xLen)
{
    BaseType_t xRetVal = pdFALSE;

    if (xQueueRxHandle == NULL || cReadChar == NULL)
    {
        return xRetVal;
    }

    /* Block until the there is input from the user */
    return xQueueReceive(xQueueRxHandle, cReadChar, portMAX_DELAY);
}

/**
* @brief Write to UART TX
* @param *buff buffer to be written.
* @retval HAL status
*/
static HAL_StatusTypeDef vConsoleWrite(const char *buff)
{
    HAL_StatusTypeDef status;
    size_t len = strlen(buff);

    if (pxUartDevHandle == NULL || *buff == '\0' || len < 1)
    {
        return HAL_ERROR;
    }

    status = HAL_UART_Transmit(pxUartDevHandle, (uint8_t *)buff, strlen(buff), portMAX_DELAY);
    if (status != HAL_OK)
    {
    	return HAL_ERROR;
    }
    return status;
}

/**
* @brief Enables UART RX reception.
* @param void
* @retval void
*/
void vConsoleEnableRxInterrupt(void)
{
    if (pxUartDevHandle == NULL)
    {
        return;
    }
    /* UART Rx IT is enabled by reading a character */
    HAL_UART_Receive_IT(pxUartDevHandle,(uint8_t*)&cRxData, 1);
}

/**
* @brief Task to handle user commands via serial communication.
* @param *pvParams Data passed at task creation.
* @retval void
*/
void vTaskConsole(void *pvParams)
{
    char cReadCh = '\0';
    uint8_t uInputIndex = 0;
    BaseType_t xMoreDataToProcess;
    char pcInputString[MAX_IN_STR_LEN];
    char pcPrevInputString[MAX_IN_STR_LEN];
    char pcOutputString[MAX_OUT_STR_LEN];

    memset(pcInputString, 0x00, MAX_IN_STR_LEN);
    memset(pcPrevInputString, 0x00, MAX_IN_STR_LEN);
    memset(pcOutputString, 0x00, MAX_OUT_STR_LEN);

    /* Create a queue to store characters from RX ISR */
    xQueueRxHandle = xQueueCreate(MAX_RX_QUEUE_LEN, sizeof(char));
    if (xQueueRxHandle == NULL)
    {
        goto out_task_console;
    }

    vConsoleWrite(pcWelcomeMsg);
    vConsoleEnableRxInterrupt();
    vConsoleWrite(prvpcPrompt);

    while(1)
    {
        /* Block until there is a new character in RX buffer */
        xConsoleRead((uint8_t*)(&cReadCh), sizeof(cReadCh));

        switch (cReadCh)
        {
            case ASCII_CR:
            case ASCII_LF:

                if (uInputIndex != 0)
                {
                    vConsoleWrite("\n\n");
                    strncpy(pcPrevInputString, pcInputString, MAX_IN_STR_LEN);
                    do
                    {
                        xMoreDataToProcess = FreeRTOS_CLIProcessCommand
                                            (
                                                pcInputString,    /* Command string*/
                                                pcOutputString,   /* Output buffer */
                                                MAX_OUT_STR_LEN   /* Output buffer size */
                                            );
                        vConsoleWrite(pcOutputString);
                    } while (xMoreDataToProcess != pdFALSE);
                }
                uInputIndex = 0;
                memset(pcInputString, 0x00, MAX_IN_STR_LEN);
                memset(pcOutputString, 0x00, MAX_OUT_STR_LEN);
                vConsoleWrite("\n");
                vConsoleWrite(prvpcPrompt);
                break;
            case ASCII_FORM_FEED:
                vConsoleWrite("\x1b[2J\x1b[0;0H");
                vConsoleWrite("\n");
                vConsoleWrite(prvpcPrompt);
                break;
            case ASCII_CTRL_PLUS_C:
                uInputIndex = 0;
                memset(pcInputString, 0x00, MAX_IN_STR_LEN);
                vConsoleWrite("\n");
                vConsoleWrite(prvpcPrompt);
                break;
            case ASCII_DEL:
            case ASCII_NACK:
            case ASCII_BACKSPACE:
                if (uInputIndex > 0)
                {
                    uInputIndex--;
                    pcInputString[uInputIndex] = '\0';
                    vConsoleWrite("\b \b");
                }
                break;
            case ASCII_TAB:
                while (uInputIndex)
                {
                    uInputIndex--;
                    vConsoleWrite("\b \b");
                }
                strncpy(pcInputString, pcPrevInputString, MAX_IN_STR_LEN);
                uInputIndex = (unsigned char)strlen(pcInputString);
                vConsoleWrite(pcInputString);
                break;
            default:
                /* Check if read character is between [Space] and [~] in ASCII table */
                if (uInputIndex < (MAX_IN_STR_LEN - 1 ) && (cReadCh >= 32 && cReadCh <= 126))
                {
                    pcInputString[uInputIndex] = cReadCh;
                    vConsoleWrite(pcInputString + uInputIndex);
                    uInputIndex++;
                }
                break;
        }
    }

out_task_console:
    if (xQueueRxHandle)
    {
        vQueueDelete(xQueueRxHandle);
    }
    vTaskDelete(NULL);
}

/**
* @brief Initialize the console by registering all commands and creating a task.
* @param usStackSize Task console stack size
* @param uxPriority Task console priority
* @param *pxUartHandle Pointer for uart handle.
* @retval FreeRTOS status
*/
BaseType_t xConsoleInit(uint16_t usStackSize, UBaseType_t uxPriority, UART_HandleTypeDef *pxUartHandle)
{
    const CLI_Command_Definition_t *pCommand;

    if (pxUartHandle == NULL)
    {
        return pdFALSE;
    }
    pxUartDevHandle = pxUartHandle;

    /* Register all commands that can be accessed by the user */
    for (pCommand = xCommands; pCommand->pcCommand != NULL; pCommand++)
    {
        FreeRTOS_CLIRegisterCommand(pCommand);
    }
    return xTaskCreate(vTaskConsole,"CLI", usStackSize, NULL, uxPriority, NULL);
}

/**
* @brief Callback for UART RX, triggered any time there is a new character.
* @param *huart Pointer to the uart handle.
* @retval void
*/
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    BaseType_t pxHigherPriorityTaskWoken = pdFALSE;

    if (xQueueRxHandle != NULL)
    {
        xQueueSendToBackFromISR(xQueueRxHandle, &cRxData, &pxHigherPriorityTaskWoken);
    }
    vConsoleEnableRxInterrupt();
}
